{
    "ocupation": "Estudante de Ciência da Computação",
    "aboutMe-button": "Sobre mim",
    "hardSkills-button": "Habilidades técnicas",
    "projects-button": "Projetos",
    "contacts-button": "Contatos",
    "biography-title": "Sobre mim",
    "biography-text": "Ola! Meu nome é Carlos Eduardo Cardoso Barreiros. Tenho 19 anos e atualmente estou cursando o quarto semestre de Ciência da Computação na Universidade Anhembi Morumbi. Eu completei minha educação primária em 2022 no Colégio Adventista da Liberdade e sempre tive paixão por computadores e uma aptidão natural para assuntos relacionados. <br> <br> Por muito tempo fiquei incerto sobre o que queria fazer, pois futebol sempre foi uma prioridade desde a infância. Tenho experiências nas categorias de base de clubes em São Paulo e até joguei profissionalmente na Alemanha, onde passei seis meses competindo no torneio regional pelo Fv Rot-Weiß Weiler, morando sozinho no apartamento do clube. E também, pelo fato de que a maioria das pessoas ao meu redor se comunicavam em inglês, acabei melhorando minhas habilidades na linguagem. <br> <br> Por outro lado, mesmo que eu estivesse jogando futebol em 2022, não descartei a oportunidade de seguir carreira em TI, sempre vi com bons olhos. Nunca deixei os estudos de lado, sempre me dediquei e me compromenti, assim como na minha curta carreira pelo futebol. Não é à toa que mesmo na Alemanha conciliei os estudos, transferindo minha matrícula para EAD e mantendo meus cursos extra curriculares nas horas vagas. Porém, em julho de 2024, quando retornei ao Brasil, concluí que estava disposto a tomar uma decisão sobre meu futuro e me dedicar 100% a uma só coisa. Contudo, optei por construir minha carreira nesse mundo da tecnologia, com qual tenho me relacionado muito bem. <br> <br> Atualmente busco minha primeira experiência profissional em TI, onde pretendo crescer profissionalmente, aprender muito e aplicar meus conhecimentos, como: Programação (back-end/front-end), Bibliotecas e Frameworks de Programação (jQuery, VueJS, React, Angular...), Banco de Dados Relacional (SQL), Banco de Dados Não-Relacional (NoSQL), UML, Requisitos de Sistema, Redes de Computadores ou Segurança da Informação. Algumas de minha habilidades interpessoais incluem foco e organização, bom relacionamento interpessoal, trabalho em equipe e forte potêncial para aprendizagem. Embora meu inglês já esteja avançado (estudei por cinco anos no CNA e pratiquei durante minha estrada na Alememanha), tenho estudado com um professor particular para me aprimorar ainda mais na linguagem.",
    "skills-title": "Habilidades técnicas",
    "java-bar-level": "intermediário",
    "js-bar-level": "avançado",
    "html-bar-level": "profissional",
    "css-bar-level": "avançado",
    "sql-bar-level": "avançado",
    "nosql-bar-level": "intermediário",
    "cn-bar-level": "intermediário",
    "cyber-bar-level": "básico", 
    "uml-bar-level": "avançado",    
    "computerNetworks-skill": "Redes de Computadores",
    "cybersecurity-skill": "Cibersegurança",
    "uml-skill": "UML e Engenharia de Requisitos",
    "projects-title": "Projetos",
    "javaBet-title": "Aplicação JavaBet",
    "javaBet-button": "ver projeto ↓",
    "javaBet-text": "Este é um projeto de faculdade, em que foi desenvolvido um aplicativo de jogos online, com jogos como blackjack e caça-níquel. O aplicativo inclui registro de usuário, funcionalidade de login e uma tela de moderador com controle de usuário. Tudo foi desenvolvido em Java, inclusive o banco de dados, onde as informações são armazenadas em array de objetos, no qual os desafios eram testar o domínio do aluno com lógica e programação orientada a objetos. <br> <br> <h4>tecnologias usadas: UML e Engenharia de Requisitos</h4>",
    "javaBet-technologies": "tecnologias usadas: Java",
    "javaBet-repository": "Repositório",
    "javaBet-close": "Fechar",
    "onefootball-title": "Melhoria para OneFootball",
    "onefootball-button": "ver projeto ↓",
    "onefootball-text": "Este também é um projeto de faculdade, mas de natureza mais teórica. Envolveu a modelagem de uma melhoria para o aplicativo OneFootball, especificamente a criação de uma área de comunidade no aplicativo onde os usuários pudessem interagir com o conteúdo de notícias. O foco principal de desenvolvimento desde projeto foi UML (Unified Modeling Language), para os diagramas e Engenharia de requisitos, para as implementações. <br> <br> <h4>tecnologias usadas: UML and Engenharia de Requisitos</h4>",
    "onefootball-documentation": "Documentação",
    "onefootball-close": "Fechar",
    "contacts-title": "Contatos",
    "contacts-location": "São Paulo, BRASIL",
    "form-name": "Nome",
    "form-message": "Mensagem",
    "form-msgSpace-placeholder": "Deixe uma menssagem...",
    "form-button": "ENVIAR",
    "footer-message": "Desenvolvido por <a class='link-me' onclick='scrollToMe(); return false;'>Carlos Barreiros</a>. © 2024 TodosDireitos Reservados.",
    "thanks-heading": "Obrigado pelo contato!",
    "thanks-message": "Retornarei para você em breve :)"
}