{
    "ocupation": "Estudante de Ciência da Computação",
    "aboutMe-button": "1. Sobre mim",
    "hardSkills-button": "2. Habilidades técnicas",
    "projects-button": "3. Projetos",
    "contacts-button": "4. Contatos",
    "biography-title": "Sobre mim",
    "biography-text": "Olá! Meu nome é Carlos Eduardo Cardoso Barreiros. Tenho 19 anos e atualmente estou cursando o quarto semestre de Ciência da Computação na Universidade Anhembi Morumbi. Concluí o ensino médio em 2022 no Colégio Adventista da Liberdade e sempre tive uma paixão por computadores, além de uma aptidão natural para assuntos relacionados. <br> <br> Por muito tempo, fiquei incerto sobre o que queria fazer, pois o futebol sempre foi uma prioridade desde a infância. Tenho experiência nas categorias de base de clubes em São Paulo e até joguei profissionalmente na Alemanha, onde passei seis meses competindo no torneio regional pelo Fv Rot-Weiß Weiler, morando sozinho no apartamento do clube. Como a maioria das pessoas ao meu redor se comunicava em inglês, acabei aprimorando minhas habilidades no idioma. <br> <br> Por outro lado, mesmo jogando futebol em 2022, não descartei a oportunidade de seguir carreira em TI, pois sempre vi essa área com bons olhos. Nunca deixei os estudos de lado; sempre me dediquei e me comprometi, assim como fiz na minha curta carreira no futebol. Não é à toa que, mesmo na Alemanha, consegui conciliar os estudos, transferindo minha matrícula para EAD e mantendo meus cursos extracurriculares nas horas vagas. Em julho de 2024, quando retornei ao Brasil, concluí que estava pronto para tomar uma decisão sobre meu futuro e me dedicar 100% a uma única coisa. Decidi, então, construir minha carreira no mundo da tecnologia, com o qual me identifico muito bem. <br> <br> Atualmente, busco minha primeira experiência profissional em TI, onde pretendo crescer profissionalmente, aprender bastante e aplicar meus conhecimentos em áreas como: Programação (back-end/front-end), Bibliotecas e Frameworks de Programação (jQuery, VueJS, React, Angular...), Banco de Dados Relacional (SQL), Banco de Dados Não Relacional (NoSQL), UML, Requisitos de Sistema, Redes de Computadores e Segurança da Informação. Entre minhas habilidades interpessoais, destacam-se o foco e a organização, o bom relacionamento interpessoal, o trabalho em equipe e o forte potencial para aprendizagem. Embora meu inglês já seja avançado (estudei por cinco anos no CNA e pratiquei durante minha estadia na Alemanha), tenho estudado com um professor particular para me aprimorar ainda mais no idioma.",
    "skills-title": "Habilidades técnicas",
    "java-bar-level": "intermediário",
    "js-bar-level": "avançado",
    "html-bar-level": "profissional",
    "css-bar-level": "avançado",
    "sql-bar-level": "avançado",
    "nosql-bar-level": "intermediário",
    "cn-bar-level": "intermediário",
    "cyber-bar-level": "básico", 
    "uml-bar-level": "avançado",    
    "computerNetworks-skill": "Redes de Computadores",
    "cybersecurity-skill": "Cibersegurança",
    "uml-skill": "UML e Engenharia de Requisitos",
    "projects-title": "Projetos",
    "javaBet-title": "Aplicação JavaBet",
    "javaBet-button": "ver projeto ↓",
    "javaBet-text": "Este é um projeto de faculdade, em que foi desenvolvido um aplicativo de jogos online, com jogos como blackjack e caça-níquel. O aplicativo inclui registro de usuário, funcionalidade de login e uma tela de moderador com controle de usuário. Tudo foi desenvolvido em Java, inclusive o banco de dados, onde as informações são armazenadas em array de objetos, no qual os desafios eram testar o domínio do aluno com lógica e programação orientada a objetos. <br> <br> <h4>tecnologias usadas: UML e Engenharia de Requisitos</h4>",
    "javaBet-technologies": "tecnologias usadas: Java",
    "javaBet-repository": "Repositório",
    "javaBet-close": "Fechar",
    "onefootball-title": "Melhoria para OneFootball",
    "onefootball-button": "ver projeto ↓",
    "onefootball-text": "Este também é um projeto de faculdade, mas de natureza mais teórica. Envolveu a modelagem de uma melhoria para o aplicativo OneFootball, especificamente a criação de uma área de comunidade no aplicativo onde os usuários pudessem interagir com o conteúdo de notícias. O foco principal de desenvolvimento desde projeto foi UML (Unified Modeling Language), para os diagramas e Engenharia de requisitos, para as implementações. <br> <br> <h4>tecnologias usadas: UML and Engenharia de Requisitos</h4>",
    "onefootball-documentation": "Documentação",
    "onefootball-close": "Fechar",
    "contacts-title": "Contatos",
    "contacts-location": "São Paulo, BRASIL",
    "form-name": "Nome",
    "form-message": "Mensagem",
    "form-msgSpace-placeholder": "Deixe uma menssagem...",
    "form-button": "ENVIAR",
    "footer-message": "Desenvolvido por <a class='link-me' onclick='scrollToMe(); return false;'>Carlos Barreiros</a>. © 2024 Todos Direitos Reservados.",
    "thanks-heading": "Obrigado pelo contato!",
    "thanks-message": "Retornarei para você em breve :)"
}
