{
    "ocupation": "Administrador de Banco de Dados/Engenheiro de Dados",
    "aboutMe-button": "1. Sobre mim",
    "hardSkills-button": "2. Habilidades técnicas",
    "projects-button": "3. Projetos",
    "contacts-button": "4. Contatos",
    "biography-title": "Sobre mim",
    "biography-text": "Olá! Meu nome é Carlos Eduardo Cardoso Barreiros, tenho 20 anos e sou estudante de Ciência da Computação na Universidade Anhembi Morumbi (conclusão prevista: dez/2026). Atualmente, atuo como Administrador de Banco de Dados Trainee na Sintel Brasil, com experiência prática em ambientes SQL Server e PostgreSQL (on-premise e AWS Aurora). Minhas atividades envolvem performance tuning, automação de rotinas, gestão de restores e backups, além do monitoramento de sistemas de missão crítica. <br> <br> Tenho como diferencial a busca por automação e eficiência, desenvolvendo soluções que reduzem erros manuais, aceleram entregas e otimizam custos. Também colaboro diretamente com equipes de desenvolvimento na criação e otimização de procedures, functions e triggers, garantindo integração fluida entre aplicações e banco de dados. <br> <br> Antes da tecnologia, vivi uma experiência marcante como jogador de futebol profissional na Alemanha, onde aprimorei meu inglês e desenvolvi competências como resiliência, disciplina, trabalho em equipe e adaptação a cenários desafiadores. Entre minhas habilidades interpessoais, destaco foco, organização, facilidade de aprendizado e colaboração em equipe. <br> <br> Sou apaixonado por dados, cloud e inteligência artificial aplicada a dados, áreas nas quais venho me aprofundando e pretendo construir minha carreira a longo prazo. Acredito no poder dos dados para gerar impacto real, trazendo eficiência, escalabilidade e melhores resultados para as organizações.",
    "skills-title": "Habilidades técnicas",
    "database-title": "Bancos de Dados",
    "dev-title": "Desenvolvimento",
    "cloud-title": "Nuvem & Sistema Operacionais",
    "analytics-title": "Dados & Analytics",
    "modeling-title": "Modelagem & Arquitetura",
    "modeling-skills": "UML · Engenharia de Requisitos",
    "projects-title": "Projetos",
    "javaBet-title": "Aplicação JavaBet",
    "javaBet-button": "ver projeto ↓",
    "javaBet-text": "Este é um projeto de faculdade, em que foi desenvolvido um aplicativo de jogos online, com jogos como blackjack e caça-níquel. O aplicativo inclui registro de usuário, funcionalidade de login e uma tela de moderador com controle de usuário. Tudo foi desenvolvido em Java, inclusive o banco de dados, onde as informações são armazenadas em array de objetos, no qual os desafios eram testar o domínio do aluno com lógica e programação orientada a objetos. <br> <br> <h4>tecnologias usadas: Java</h4>",
    "javaBet-repository": "Repositório",
    "javaBet-close": "Fechar",
    "onefootball-title": "Melhoria para OneFootball",
    "onefootball-button": "ver projeto ↓",
    "onefootball-text": "Este também é um projeto de faculdade, mas de natureza mais teórica. Envolveu a modelagem de uma melhoria para o aplicativo OneFootball, especificamente a criação de uma área de comunidade no aplicativo onde os usuários pudessem interagir com o conteúdo de notícias. O foco principal de desenvolvimento desde projeto foi a Modelagem de Dados, utilizando UML (Unified Modeling Language), para os diagramas e Engenharia de requisitos, para as implementações. <br> <br> <h4>tecnologias usadas: UML and Engenharia de Requisitos</h4>",
    "onefootball-documentation": "Documentação",
    "onefootball-close": "Fechar",
    "crud-title": "Aplicação CRUD",
    "crud-button": "ver projeto ↓",
    "crud-text": "Aplicação web completa que simula um sistema de cadastro e gerenciamento de usuários, desenvolvido como desafio pessoal para aprofundar conhecimentos em desenvolvimento full-stack. O sistema permite que os usuários façam seu cadastro e login, visualizem suas informações e excluam suas contas. Para moderadores, há um painel com funcionalidades de controle completo sobre os usuários, incluindo cadastro, edição e exclusão. <br> <br> <h4>tecnologias usadas: React, CSS Tailwind, Node.js, Express e MySQL</h4>",
    "crud-repository": "Repositório",
    "crud-close": "Fechar",
    "contacts-title": "Contatos",
    "contacts-location": "São Paulo, BRASIL",
    "form-name": "Nome",
    "form-message": "Mensagem",
    "form-msgSpace-placeholder": "Deixe uma menssagem...",
    "form-button": "ENVIAR",
    "footer-message": "Desenvolvido por <a class='link-me' onclick='scrollToMe(); return false;'>Carlos Barreiros</a>. © 2024 Todos Direitos Reservados.",
    "thanks-heading": "Obrigado pelo contato!",
    "thanks-message": "Retornarei para você em breve :)"
}