{
    "ocupation": "Database Administrator/Data Engineer",
    "aboutMe-button": "1. About me",
    "hardSkills-button": "2. Hard skills",
    "projects-button": "3. Projects",
    "contacts-button": "4. Contacts",
    "biography-title": "About me",
    "biography-text": "Hi there! My name is Carlos Eduardo Cardoso Barreiros, I’m 20 years old and currently pursuing a Bachelor’s degree in Computer Science at Anhembi Morumbi University (expected graduation: Dec/2026). I am working as a Database Administrator Trainee at Sintel Brasil, with hands-on experience in SQL Server and PostgreSQL (on-premise and AWS Aurora). My daily activities include performance tuning, automation of routines, managing restores and backups, and monitoring mission-critical systems. <br> <br> My main differentiator is the constant pursuit of automation and efficiency, developing solutions that reduce manual errors, speed up deliveries, and optimize costs. I also collaborate directly with development teams in the creation and optimization of procedures, functions, and triggers, ensuring smooth integration between applications and databases. <br> <br> Before working in technology, I had a remarkable experience as a professional soccer player in Germany, where I improved my English and developed key skills such as resilience, discipline, teamwork, and adaptability to challenging environments. Among my interpersonal strengths, I highlight focus, organization, fast learning, and collaboration. <br> <br> I am passionate about data, cloud, and artificial intelligence applied to data—fields in which I am continuously deepening my knowledge and aiming to build my long-term career. I strongly believe in the power of data to generate real impact, driving efficiency, scalability, and better results for organizations.",
    "skills-title": "Hard Skills",
    "database-title": "Databases",
    "dev-title": "Development",
    "cloud-title": "Cloud & Operating Systems",
    "analytics-title": "Data & Analytics",
    "modeling-title": "Modeling & Architecture",
    "modeling-skills": "UML · Requiriments Engineering",
    "projects-title": "Projects",
    "onefootball-title": "OneFootball Improvement",
    "onefootball-button": "view project ↓",
    "onefootball-text": "This was also a college project, but more theoretical in nature. It involved modeling an improvement to the OneFootball app, specifically creating a community area in the app where users could interact with news content. The main focus of development of this project was Data Modeling, using UML (Unified Modeling Language), for the diagrams and Requirements Engineering, for the implementations. <br> <br> <h4>technologies used: UML and Requiriments Engineering</h4>",
    "onefootball-documentation": "Documentation",
    "onefootball-close": "Close",
    "crud-title": "CRUD Application",
    "crud-button": "view project ↓",
    "crud-text": "A complete web application that simulates a user registration and management system, developed as a personal challenge to deepen knowledge in full-stack development. The system allows users to register, log in, view their information, and delete their accounts. For moderators, there is a panel with full control features over users, including registration, editing, and deletion. <br> <br> <h4>technologies used: React, CSS Tailwind, Node.js, Express and MySQL</h4>",
    "crud-repository": "Repository",
    "crud-close": "Close",
    "contacts-title": "Contacts",
    "contacts-location": "São Paulo, BRAZIL",
    "form-name": "Name",
    "form-message": "Message",
    "form-msgSpace-placeholder": "Leave a message...",
    "form-button": "SENT",
    "footer-message": "Developed by <a class='link-me' onclick='scrollToMe(); return false;'>Carlos Barreiros</a>. © 2024 All Rights Reserved.",
    "thanks-heading": "Thank you for your contact!",
    "thanks-message": "I will get back to you soon :)"
}