{
    "ocupation": "Computer Science Student",
    "aboutMe-button": "1. About me",
    "hardSkills-button": "2. Hard skills",
    "projects-button": "3. Projects",
    "contacts-button": "4. Contacts",
    "biography-title": "About me",
    "biography-text": "Hi there! My name is Carlos Eduardo Cardoso Barreiros. I’m 19 years old, currently in the fifth semester of my Computer Science degree at Anhembi Morumbi University. I graduated high school in 2022 from Adventist College of Liberdade and have always been passionate about computers, with a natural aptitude for related subjects. Over time, I developed a strong interest in fields such as data, software modeling, and creating innovative solutions through technology. <br> <br> My journey also includes enriching experiences beyond the classroom. I spent six months living in Germany, where I played professional soccer for Fv Rot-Weiß Weiler. This experience not only allowed me to improve my English in an international environment but also helped me strengthen valuable skills like discipline, resilience, teamwork, and adaptability. <br> <br> Despite my soccer career, I never neglected my education. I transferred my college program to an online format and continued to invest in extracurricular courses. This dedication led me to make an important decision in 2024: to fully commit to the IT field, where I see incredible opportunities to grow and make a meaningful impact. <br> <br> Currently, I’m looking for my first professional experience in IT, focusing on data, technological solution development, and artificial intelligence – areas where I aim to build a long-term career. However, I’m open to other opportunities and always eager to learn and adapt to market demands. My knowledge includes Programming, Databases, Cloud Computing, Software Modeling, Data Analysis, and Artificial Intelligence. <br> <br> When it comes to interpersonal skills, I am highly focused, organized, a strong team player, and have a natural ability to learn quickly. Additionally, I’m actively improving my English through private lessons to ensure full proficiency in technical and business environments. I’m excited to bring my skills, determination, and enthusiasm to contribute to challenging and innovative projects.",
    "skills-title": "Hard Skills",
    "java-bar-level": "basic",
    "js-bar-level": "intermediary",
    "html-bar-level": "advanced",
    "react-bar-level": "intermediary",
    "sql-bar-level": "intermediary",
    "node-bar-level": "intermediary",
    "cloud-bar-level": "basic",
    "git-bar-level": "advanced", 
    "uml-bar-level": "intermediary",    
    "cloud-skill": "Cloud Computing",
    "cybersecurity-skill": "Cybersecurity",
    "uml-skill": "UML e Requiriments Engineering",
    "projects-title": "Projects",
    "javaBet-title": "JavaBet Application",
    "javaBet-button": "view project ↓",
    "javaBet-text": "This was a college project in which an online gaming application was developed, with games such as blackjack and slot machines. The app includes user registration, login functionality and a moderator screen with user control. Everything was developed in Java, including the database, where user information is stored in an array of objects. The challenges were to test the student's mastery of logic and object-oriented programming. <br> <br> <h4>technologies used: Java</h4>",
    "javaBet-repository": "Repository",
    "javaBet-close": "Close",
    "onefootball-title": "OneFootball Improvement",
    "onefootball-button": "view project ↓",
    "onefootball-text": "This was also a college project, but more theoretical in nature. It involved modeling an improvement to the OneFootball app, specifically creating a community area in the app where users could interact with news content. The main focus of development of this project was Data Modeling, using UML (Unified Modeling Language), for the diagrams and Requirements Engineering, for the implementations. <br> <br> <h4>technologies used: UML and Requiriments Engineering</h4>",
    "onefootball-documentation": "Documentation",
    "onefootball-close": "Close",
    "crud-title": "CRUD Application",
    "crud-button": "view project ↓",
    "crud-text": "A complete web application that simulates a user registration and management system, developed as a personal challenge to deepen knowledge in full-stack development. The system allows users to register, log in, view their information, and delete their accounts. For moderators, there is a panel with full control features over users, including registration, editing, and deletion. <br> <br> <h4>technologies used: React, CSS Tailwind, Node.js, Express and MySQL</h4>",
    "crud-repository": "Repository",
    "crud-close": "Close",
    "contacts-title": "Contacts",
    "contacts-location": "São Paulo, BRAZIL",
    "form-name": "Name",
    "form-message": "Message",
    "form-msgSpace-placeholder": "Leave a message...",
    "form-button": "SENT",
    "footer-message": "Developed by <a class='link-me' onclick='scrollToMe(); return false;'>Carlos Barreiros</a>. © 2024 All Rights Reserved.",
    "thanks-heading": "Thank you for your contact!",
    "thanks-message": "I will get back to you soon :)"
}