{
    "ocupation": "Computer Science Student",
    "aboutMe-button": "1. About me",
    "hardSkills-button": "2. Hard skills",
    "projects-button": "3. Projects",
    "contacts-button": "4. Contacts",
    "biography-title": "About me",
    "biography-text": "Hi there! My name is Carlos Eduardo. I am nineteen years old and enrolled in the fourth semester of Computer Science at Anhembi Morumbi University. I completed high school at Adventist College of Liberdade in 2022. I've always had a passion for computers and a natural aptitude for related subjects. <br> <br> I was uncertain about what I wanted to do for a long time. Soccer has always been a top priority for me since childhood. I have experience in soccer clubs in Sao Paulo and have even played professionally in Germany. I spent six months competing in the regional tournament for Fv Rot-Weiß Weiler in Germany. I lived by myself at he team apartment and improved my English skills because most people around me communicated in English. <br> <br> On the other hand, even though I had been playing soccer in 2022, I never dismissed the opportunity of following an IT career; I always saw it with good eyes. I never put my studies aside; I always dedicated and committed myself to the maximum possible regarding my studies and soccer professional life. It is not for nothing that even when I lived in Germany, I conciliated my studies by transferring my tuition to a Distance Learning course and keeping my skill courses in my free time. Nevertheless, in July 2024, when I returned to Brazil, I concluded that I was willing to make a decision about my future and dedicate myself 100% to one thing only. I decided to build my career in this computing world, which I have been relating very well to. <br> <br> Nowadays, I am seeking my first professional experience in IT, where I intend to grow, earn a lot, and apply some of my knowledge in software development, such as: Programming (back-end/front-end), Database (Relational and Non-Relational), Data Analysis, Cloud Computing, Computer Networks, Information Security and Software Modeling. Some of my soft skills include being focused and organized, having good interpersonal relationships, teamwork, and a strong aptitude for learning. Even though my English skills are already advanced - I have studied for five years at CNA and practiced my English during my stay in Germany, I have been studying with a private teacher to refine my English even further.",
    "skills-title": "Hard Skills",
    "java-bar-level": "intermediary",
    "js-bar-level": "intermediary",
    "html-bar-level": "advanced",
    "react-bar-level": "intermediary",
    "sql-bar-level": "intermediary",
    "nosql-bar-level": "basic",
    "cn-bar-level": "intermediary",
    "git-bar-level": "advanced", 
    "uml-bar-level": "intermediary",    
    "computerNetworks-skill": "Computer Networks",
    "cybersecurity-skill": "Cybersecurity",
    "uml-skill": "UML e Requiriments Engineering",
    "projects-title": "Projects",
    "javaBet-title": "JavaBet Application",
    "javaBet-button": "view project ↓",
    "javaBet-text": "This was a college project in which an online gaming application was developed, with games such as blackjack and slot machines. The app includes user registration, login functionality and a moderator screen with user control. Everything was developed in Java, including the database, where user information is stored in an array of objects. The challenges were to test the student's mastery of logic and object-oriented programming. <br> <br> <h4>technologies used: Java</h4>",
    "javaBet-repository": "Repository",
    "javaBet-close": "Close",
    "onefootball-title": "OneFootball Improvement",
    "onefootball-button": "view project ↓",
    "onefootball-text": "This was also a college project, but more theoretical in nature. It involved modeling an improvement to the OneFootball app, specifically creating a community area in the app where users could interact with news content. The main focus of development of this project was UML (Unified Modeling Language), for the diagrams and Requirements Engineering, for the implementations. <br> <br> <h4>technologies used: UML and Requiriments Engineering</h4>",
    "onefootball-documentation": "Documentation",
    "onefootball-close": "Close",
    "crud-title": "CRUD Application",
    "crud-button": "view project ↓",
    "crud-text": "A complete web application that simulates a user registration and management system, developed as a personal challenge to deepen knowledge in full-stack development. The system allows users to register, log in, view their information, and delete their accounts. For moderators, there is a panel with full control features over users, including registration, editing, and deletion. <br> <br> <h4>technologies used: React, CSS Tailwind, Node.js, Express and MySQL</h4>",
    "crud-repository": "Repository",
    "crud-close": "Close",
    "contacts-title": "Contacts",
    "contacts-location": "São Paulo, BRAZIL",
    "form-name": "Name",
    "form-message": "Message",
    "form-msgSpace-placeholder": "Leave a message...",
    "form-button": "SENT",
    "footer-message": "Developed by <a class='link-me' onclick='scrollToMe(); return false;'>Carlos Barreiros</a>. © 2024 All Rights Reserved.",
    "thanks-heading": "Thank you for your contact!",
    "thanks-message": "I will get back to you soon :)"
}